from src.services import find_people_pass

my_lst_dict = [
    {
        "Дата операции": "31.12.2021 00:12:53",
        "Дата платежа": "31.12.2021",
        "Номер карты": 5321,
        "Статус": "OK",
        "Сумма операции": -800.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -800.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": 0,
        "Категория": "Переводы",
        "MCC": 1111,
        "Описание": "Константин Л.",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 800.0
    }
]


def test_find_people_pass() -> None:
    assert find_people_pass(my_lst_dict) == [
        {
            "Дата операции": "31.12.2021 00:12:53",
            "Дата платежа": "31.12.2021",
            "Номер карты": 5321,
            "Статус": "OK",
            "Сумма операции": -800.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -800.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Переводы",
            "MCC": 1111,
            "Описание": "Константин Л.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 800.0
        }
    ]
